Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/worksheets/worksheet_jobseekers_allowance_and_income_from_work.html.txt.tmx
Source language: en
Languages: ga

source: Worksheet: Jobseeker's Allowance and income from work
ga: Bileog oibre: Liúntas Cuardaitheora Poist agus ioncam ón obair

source: This worksheet aims to help you find out how taking up part-time or casual work will affect your weekly Jobseeker's Allowance
ga: Tá sé d’aidhm ag an mbileog oibre seo cabhrú leat a fháil amach cén tionchar a bheidh ag obair páirtaimseartha nó ócáideach ar do Liúntas Cuardaitheora Poist seachtainiúil

source: Income from work is assessed as means and can affect your Jobseeker's Allowance payment
ga: Déantar ioncam ón obair a mheasúnú mar acmhainn agus is féidir leis sin dul i gcion ar d’íocaíocht don Liúntas Cuardaitheora Poist

source: Other sources of income or means can also affect your Jobseeker's Allowance, for example, maintenance, benefit and privilege, cash income and capital (including savings and investments)
ga: Is féidir le foinsí eile ioncaim nó acmhainní dul i gcion ar do Liúntas Cuardaitheora Poist chomh maith, mar shampla, cothabháil, sochar agus pribhléid, ioncam airgid agus capiteal (coigilteas agus infheistíochtaí san áireamh)

source: In this worksheet we are only looking at how income from work can affect your payment
ga: Sa bhileog oibre seo nílimid ach ag féachaint ar an chaoi ar féidir le hioncam ón obair dul i gcion ar d'íocaíocht

source: A person is entitled to Jobseeker's Allowance (JA) only for periods of unemployment
ga: Níl duine i dteideal Liúntas Cuardaitheora Poista (LCP) in Éirinn ach do thréimhsí dífhostaíochta amháin

source: You must be unemployed for at least 4 days in a period of 7 consecutive days to get JA
ga: Is í an íostréimhse go gcaithfidh tú a bheith dífhostaithe chun LCP a fháil ná 4 lá i dtréimhse 7 lá leanúnach, gan an Domhnach san áireamh

source: More information on the qualifying criteria is available in our document on Jobseeker's Allowance
ga: Tá tuilleadh eolais faoi na critéir cháilithe le fáil inár ndoiciméad faoin Liúntas Cuardaitheora Poist

source: Jobseeker's Allowance weekly rate _________
ga: Liúntas Cuardaitheora Poist (uasráta seachtainiúil)

source: (Your age can determine
ga: (Is féidir d'aois an íocaíocht

source: your maximum weekly rate
ga: uasta maidir le do chúinsí a

source: Find your rate in our
ga: Faigh amach do ráta

source: document on Jobseeker's Allowance)
ga: sa doiciméad faoi Liúntas Cuardaitheora Poist)

source: Add Child Dependant Increase
ga: Móide Méadú le haghaidh Cleithiúnaí Linbh _+________

source: (€29.80 for each child dependant, if
ga: (€29.80 méadaithe faoi líon na gcleithiúnaithe linbh

source: your means are halved you will +_______
ga: Má ghearrtar d’acmhainní faoi leath

source: get €14.90 for each child dependant,
ga: gheobhaidh tú €14.90 do gach leanbh incháilithe-

source: see 'Step 2' below)
ga: féach 'Céim 2' thíos)

source: Add Increase for a Qualified Adult
ga: Móide Méadú le haghaidh Duine Fásta Cáilithe

source: (You will not get an increase for +________
ga: (Má ghearrtar d’acmhainní faoi leath

source: a dependent spouse/civil partner/cohabitant, if
ga: ní bheidh an méadú le haghaidh duine fásta

source: your spouse is getting a payment in their own right, see 'Step 2' below)
ga: cáilithe iníoctha - féach 'Céim 2' thíos.)

source: Total (maximum Jobseeker's Allowance)_________
ga: Iomlán (Uasmhéid an Liúntais Cuardaitheora Poist)

source: Less weekly means from work_-______
ga: Lúide acmhainní seachtainiúla ón obair _-______

source: (Go to extra information below to help
ga: (Téigh chuig eolas breise thíos le cabhrú leat

source: you calculate your weekly means from work.)
ga: d’acmhainní seachtainiúla ón obair a ríomh.)

source: Less spouse's/civil partner's/cohabitant's weekly means from work_-_______
ga: Lúide acmhainní seachtainiúla an chéile/pháirtí ón obair _-____

source: you calculate your spouse, civil partner or cohabitant's
ga: (Téigh chuig eolas breise thíos le cabhrú leat

source: Total weekly Jobseeker's Allowance payment €________
ga: Íocaíocht sheachtainiúil iomlán don Liúntas Cuardaitheora Poist €________

source: Extra information: How to find your weekly means from work
ga: Eolas breise: Conas d’acmhainní seachtainiúla ón obair a dhéanamh amach

source: Use Steps 1-5 to calculate your weekly means from work
ga: Bain úsáid as céimeanna 1-5 chun d’acmhainní seachtainiúla ón obair a ríomh

source: Step 1: Assessable weekly earnings
ga: Céim 1: Tuilleamh seachtainiúil inmheasúnaithe

source: Find your assessable weekly earnings
ga: Faigh do thuilleamh seachtainiúil inmheasúnaithe

source: The following items are always deducted from your gross earnings to get your assessable earnings:
ga: Déantar na míreanna seo a leanas a asbhaint ó d'olltuilleamh i gcónaí chun do thuilleamh inmheasúnaithe a fháil:

source: • PRSA (Personal Retirement Savings Account)
ga: • CCSP (Cuntas Coigiltis Scoir Pearsanta)

source: │Jim is a single man aged 27
ga: │Is fear singil é Jim atá 27 bliain d'aois

source: He works 3 days (Monday, Tuesday and Wednesday) and gets €50 │
ga: Oibríonn sé 3 lá sa tseachtain (Dé Luain, Dé Máirt agus Dé Céadaoin) agus faigheann sé €50 in aghaidh an lae

source: │per day. His assessable weekly earnings are €150
ga: Is é a thuilleamh seachtainiúil inmheasúnaithe ná €150

source: We will assume he is not paying any │ │contribution towards superannuation, union dues, PRSA or AVC
ga: Glacaimid leis nach bhfuil ranníocaíocht ar bith á híoc aige maidir le haoisliúntas, dleachtanna ceardchumainn, CCSP nó RSB

source: He does not pay PRSI because│ │his earnings are less than €352. │
ga: Ní íocann sé ÁSPC toisc go bhfuil a thuilleamh níos lú ná €352.│

source: │Assessable weekly earnings = €150 │
ga: │Tuilleamh seachtainiúil inmheasúnaithe = €150 │

source: Step 2: Find out if your assessable weekly earnings are over the limit
ga: Céim 2: Faigh amach an bhfuil do thuilleamh seachtainiúil inmheasúnaithe thar an teorainn

source: Before you calculate how much JA you can get, you must find out if your weekly means are more than the maximum JA payment for your situation. The maximum Jobseeker’s Allowance payment includes the personal payment and any increases for an adult dependant and dependent children
ga: Sular féidir leat an méid LCP a bhféadfá a fháil a ríomh, ní mór duit a fháil amach an bhfuil d’acmhainní seachtainiúla níos mó ná an uasíocaíocht LCP do do staid

source: If your means are halved, an increase for a qualified adult is not included in the maximum Jobseeker’s Allowance payment for your situation and you will only get a half-rate increase for each qualified child
ga: Cuimsíonn an uasíocaíocht don Liúntas Cuardaitheora Poist an uasíocaíocht phearsanta agus méadú ar bith le haghaidh duine fásta cáilithe agus leanaí cleithiúnacha

source: In this step you are not calculating the actual amount of JA you will get, you are just checking to see if you have any possibility of getting JA
ga: Sa chéim seo níl méid iarbhír an LCP á ríomh agat, níl tú ach ag seiceáil an bhfuil tú in ann LCP a fháil

source: To do this take your assessable weekly earnings from Step 1 and deduct €20 per day for each day you have worked up to a maximum of €60
ga: Chun é seo a dhéanamh tóg do thuilleamh seachtainiúil inmheasúnaithe ó Chéim 1 agus bain €20 in aghaidh an lae do gach lá a d’oibrigh tú suas le huasmhéid de €60

source: Next get 60% of the balance
ga: Ansin faigh 60% den iarmhéid

source: This is assessed as your weekly means
ga: Measúnaítear é seo mar d’acmhainní seachtainiúla

source: Assessable weekly earnings - €20 = total x 60% = weekly means from work
ga: Tuilleamh seachtainiúil inmheasúnaithe - €20 = iomlán x 60% = acmhainní seachtainiúla ón obair

source: Your means are halved if your spouse, civil partner or cohabitant is:
ga: Roinntear d'acmhainní faoi leath má tá do chéile/pháirtnéir sibhialta/chomhchónaitheoir:

source: • Getting a social welfare payment (except Child Benefit, Disablement Pension, guardian's payment, Supplementary Welfare Allowance, Domiciliary Care Allowance and half-rate Carer's Allowance)
ga: • Ag fáil íocaíochta leasa shóisialaigh (seachas Sochar Leanaí agus Pinsean Míchumais, Liúntas Cúram Baile, íocaíocht chaomhnóra, Liúntas Leasa Forlíontach agus Liúntas Cúramóra leath-ráta)

source: • On a Further Education and Training (FET) or VTOS course and getting an allowance in his or her own right
ga: • Ar chúrsa FET nó SDOG agus ag fáil liúntais ina c(h)eart féin

source: Note: If your means are halved, you will not get an increase for a qualified adult but you will get a half-rate increase for each qualified child when finding the maximum Jobseeker’s Allowance payment for your situation
ga: Nóta: Má ghearrtar d’acmhainní faoi leath, ní bhfaighidh tú an méadú le haghaidh duine fásta cáilithe ach is féidir leat méadú leathráta a fháil do gach leanbh incháilithe

source: If your weekly means are less than the maximum Jobseeker’s Allowance payment for your situation then go to Step 3 and start to calculate the actual amount of JA you will get
ga: Má tá d’acmhainní seachtainiúla níos lú ná an t-uasráta seachtainiúil do do chúinsí ansin téigh chuig Céim 3 agus tosaigh ar mhéid iarbhír an LLCF a gheobhaidh tú a ríomh

source: │Jim's assessable weekly earnings are €150 per week
ga: │Is é tuilleamh seachtainiúil inmheasúnaithe Jim ná €150 in aghaidh na seachtaine

source: He works 3 days. │
ga: Oibríonn sé 3 lá sa tseachtain.│

source: │€150 - €60 (3 days) = €90 x 60% = €54 │
ga: │€150 - €60 (3 lá) = €90 x 60% = €54 │

source: │Weekly means from work = €54 │
ga: │Acmhainní seachtainiúla ón obair = €54 │

source: │In this example, Jim’s weekly means are below the basic JA payment for his situation
ga: │Sa sampla seo, tá acmhainní seachtainiúla Jim faoi bhun na buníocaíochta LCP dá chúinsí

source: Go │ │to Step 3
ga: Téigh chuig Céim 3

source: Step 3: Average daily earnings
ga: Céim 3: Meántuilleamh laethúil

source: Now that you know you are entitled to a JA payment, you can start to calculate the rate of your JA payment
ga: Anois go bhfuil a fhios agat go bhfuil tú i dteideal íocaíochta LCP is féidir leat tosú ar ráta d’íocaíochta LCP a ríomh

source: Calculate your average daily earnings: to do this get your total weekly assessable earnings from employment and divide by the number of days you worked that week
ga: Déan do mheántuilleamh laethúil a ríomh: chun é seo a dhéanamh faigh do thuilleamh seachtainiúil inmheasúnaithe iomlán ó fhostaíocht agus roinn faoin líon laethanta a d’oibrigh tú an tseachtain sin

source: Total weekly earnings ÷ number of days worked = average daily earnings
ga: Tuilleamh seachtainiúil iomlán ÷ líon laethanta oibrithe = meántuilleamh laethúil

source: │Jim works 3 days each week (Monday, Tuesday and Wednesday) and gets €150 per week. │
ga: │Oibríonn Jim 3 lá sa tseachtain (Dé Luain, Dé Máirt agus Dé Céadaoin) agus faigheann sé €150 in aghaidh na seachtaine.│

source: │Average daily earnings = €50 │
ga: │Meántuilleamh laethúil = €50 │

source: Step 4: Daily means from work
ga: Céim 4: Acmhainní laethúla ón obair

source: Calculate your daily means from work
ga: Déan d’acmhainní laethúla ón obair a ríomh

source: To do this, you must disregard any income not taken into account
ga: Chun é seo a dhéanamh, ní mór duit neamhaird a thabhairt ar ioncam ar bith nár cuireadh san áireamh

source: Income not taken into account is €20 for days worked
ga: Is é an t-ioncam nach gcuirtear san áireamh ná €20 do oibrítear

source: This is assessed as your daily means
ga: Measúnaítear é seo mar d’acmhainní laethúla

source: Average daily earnings - €20 = total x 60% = daily means from work
ga: Meántuilleamh laethúil - €20 = iomlán x 60% = acmhainní laethúla ón obair

source: │Jim works 3 days (Monday, Tuesday and Wednesday) and gets €50 per day
ga: │Oibríonn Jim 3 lá sa tseachtain (Dé Luain, Dé Máirt agus Dé Céadaoin) agus faigheann sé €50 in aghaidh an lae.│

source: │earnings are €50 (see Step 3)
ga: │Faigheann sé meántuilleamh laethúil de €50 (féach Céim 3)

source: │Get 60% of total (€30 in this example) = €18 │
ga: │Faigh 60% den iomlán (€30 sa sampla seo) = €18 │

source: │Daily means from work = €18 │
ga: │Acmhainní laethúla ón obair = €18 │

source: Step 5: Weekly means from work
ga: Céim 5: Acmhainní seachtainiúla ón obair

source: Multiply your daily means by the number of days worked (including Sunday)
ga: Méadaigh d’acmhainní laethúla faoin líon laethanta oibrithe

source: Daily means from work x number of days worked = weekly means from work
ga: Acmhainní laethúla ón obair x líon laethanta oibrithe = acmhainní seachtainiúla ón obair

source: Your means are halved if your spouse/civil partner/cohabitant is:
ga: Roinntear d'acmhainní faoi leath má tá do chéile/pháirtnéir sibhialta/chomhchónaitheoir:

source: • On a FET or VTOS course and getting an allowance in his or her own right
ga: • Ar chúrsa FET nó SDOG agus ag fáil liúntais ina c(h)eart féin

source: Note: If your means are halved, you will not get an increase for a qualified adult but you will get a half-rate increase for each qualified child
ga: Nóta: Má ghearrtar d’acmhainní faoi leath, ní bhfaighidh tú an méadú le haghaidh duine fásta cáilithe ach is féidir leat méadú leathráta a fháil do gach leanbh incháilithe

source: │Jim works 3 days and get €50 per day
ga: │Oibríonn Jim 3 lá sa tseachtain agus faigheann sé €50 in aghaidh an lae

source: His average daily earnings are €50
ga: Faigheann sé meántuilleamh laethúil de €50.│

source: │from work is €18 (see Step 4)
ga: │Faigheann sé acmhainní laethúla de €18 ón obair (féach Céim 4)

source: │€18 x 3 days = €54 │
ga: │€18 x 3 lá = €54 │

source: Extra information: How to find your spouse's, civil partner's or cohabitant's weekly means from work
ga: Eolas breise: Conas acmhainní seachtainiúla ón obair do chéile/pháirtnéir sibhialta/chomhchónaitheoir a dhéanamh amach

source: To calculate your spouse's, civil partner's or cohabitant's weekly means from work first calculate his/her assessable earnings
ga: Chun acmhainní seachtainiúla ón obair do chéile/pháirtnéir sibhialta/chomhchónaitheoir a ríomh caithfear a t(h)uilleamh inmheasúnaithe a ríomh ar dtús

source: The following items are always deducted from his/her gross earnings to get assessable earnings:
ga: Déantar na míreanna seo a leanas a asbhaint óna (h)olltuilleamh i gcónaí chun tuilleamh inmheasúnaithe a fháil:

source: Deduct €20 per day from your spouse's/civil partner's/cohabitant's assessable earnings for each day worked up to a maximum of €60 (including Sunday)
ga: Bain €20 in aghaidh an lae ó thuilleamh inmheasúnaithe do chéile/pháirtnéir sibhialta/chomhchónaitheoir do gach lá oibrithe suas le huasmhéid de €60 (an Domhnach san áireamh)

source: This is assessed as his/her weekly means
ga: Déantar é seo a mheasúnú mar a (h)acmhainní seachtainiúla

source: Assessable weekly earnings - €20 per day (maximum 3 days)= total x 60% = weekly means from work
ga: Tuilleamh seachtainiúil inmheasúnaithe - €20 in aghaidh an lae (uasmhéid de 3 lá) = iomlán x 60% = acmhainní seachtainiúla ón obair

source: │Partner's assessable weekly earnings are €150 per week. Partner works 3 days (Wednesday, │
ga: │Is é tuilleamh seachtainiúil inmheasúnaithe an chéile ná €150 in aghaidh na seachtaine
